<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"aad14eb645506c949ffd997212708042a2b93d08ec25784d29cf1a2017f623b6","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #735 at https://github.com/cal-itp/data-infra/actions/runs/18172480950","plan_out_hash":"678dd2a290f0fccd6565ccdd73c8ab2025023f90530b729e88e6b4137eb79e22","plan_hash":"11c6bd8a063016dbb34af43f829947cae259e7bbee1a692d7078a59f1ac56f10","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/kuba/fct_kuba__device_properties.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "iFu7+Q==" -> (known after apply)
!~      detect_md5hash      = "C4+qxzOSw2CvXVQpT8sjkw==" -> "different hash"
!~      generation          = 1755538686034105 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/kuba/fct_kuba__device_properties.sql"
!~      md5hash             = "C4+qxzOSw2CvXVQpT8sjkw==" -> (known after apply)
        name                = "data/warehouse/models/mart/kuba/fct_kuba__device_properties.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/.DS_Store"] will be destroyed
  # (because key ["models/staging/ntd_annual_reporting/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1759341518465210 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fstaging%2Fntd_annual_reporting%2F.DS_Store?generation=1759341518465210&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       output_name         = "data/warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fstaging%2Fntd_annual_reporting%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #735](https://github.com/cal-itp/data-infra/actions/runs/18172480950)